Terraform Plan Output:
```
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Reading...
module.appcd_86ec452a-770a-59bf-87dd-67ed883e25e5.aws_cloudwatch_log_group.this: Refreshing state... [id=/aws/lambda/hello-kitty-function-srinivasan-balaji-28]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_key.custom_s3_kms_key[0]: Refreshing state... [id=3e672a87-a211-4f98-be1d-70083cff213b]
module.appcd_b71fd16c-797e-5a95-8e1b-ab22f1e34f43.aws_iam_role.this: Refreshing state... [id=hello-kitty-role-srinivasan.balaji-28]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket.this: Refreshing state... [id=srinivasan-balaji-28]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_caller_identity.current: Read complete after 0s [id=222634395437]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_public_access_block.this: Refreshing state... [id=srinivasan-balaji-28]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_kms_alias.a[0]: Refreshing state... [id=alias/s3-srinivasan-balaji-28]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_iam_policy_document.website_bucket_policy[0]: Reading...
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_versioning.this[0]: Refreshing state... [id=srinivasan-balaji-28]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=srinivasan-balaji-28]
module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.data.aws_iam_policy_document.website_bucket_policy[0]: Read complete after 0s [id=2592871665]
module.appcd_5b74e6ad-83ac-45a3-8e03-6ca2591a17fb.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-srinivasan.balaji-28:aws_s3-hello-kitty-policy]
module.appcd_6496abc3-a41c-40eb-8609-488810d9a45c.aws_iam_role_policy.this: Refreshing state... [id=hello-kitty-role-srinivasan.balaji-28:Writer]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this: Refreshing state... [id=hello-kitty-function-srinivasan-balaji-28]
module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function_url.this[0]: Refreshing state... [id=hello-kitty-function-srinivasan-balaji-28]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.appcd_00a20b0a-2ec0-5bdc-a08d-65a85dc81d5b.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "hello-kitty-function-srinivasan-balaji-28"
        tags                           = {
            "appstack"  = "hello-kutty"
            "component" = "hello-kitty"
        }
        # (31 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "IMAGES_BUCKET" = "Srinivasan-Balaji-28" -> "srinivasan-balaji-28"
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_policy.website_bucket_policy[0] will be created
  + resource "aws_s3_bucket_policy" "website_bucket_policy" {
      + bucket = "srinivasan-balaji-28"
      + id     = (known after apply)
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:GetObject"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "arn:aws:s3:::srinivasan-balaji-28/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
    }

  # module.appcd_551e1d2b-88ec-5406-87cf-c51521bbe894.aws_s3_bucket_website_configuration.this[0] will be created
  + resource "aws_s3_bucket_website_configuration" "this" {
      + bucket           = "srinivasan-balaji-28"
      + id               = (known after apply)
      + routing_rules    = (known after apply)
      + website_domain   = (known after apply)
      + website_endpoint = (known after apply)

      + error_document {
          + key = "404.html"
        }

      + index_document {
          + suffix = "index.html"
        }

      + routing_rule (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + aws_s3_srinivasan_balaji_28_bucket_website_endpoint                                = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```